{
  "_name_or_path": "google/vit-base-patch16-224",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "basal_cell_carcinoma",
    "1": "benign_keratosis-like_lesions",
    "2": "melanocytic_Nevi",
    "3": "actinic_keratoses",
    "4": "dermatofibroma",
    "5": "melanoma",
    "6": "vascular_lesions"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "actinic_keratoses": 3,
    "basal_cell_carcinoma": 0,
    "benign_keratosis-like_lesions": 1,
    "dermatofibroma": 4,
    "melanocytic_Nevi": 2,
    "melanoma": 5,
    "vascular_lesions": 6
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.38.1"
}
